app/controllers/applicants_controller.rb

SELECT "applicants".* FROM "applicants"
---
  def index
    @applicants = Applicant.all

INSERT INTO "applicants" ("first_name", "last_name", "email", "phone", "zipcode", "referral_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @applicant = Applicant.new(applicant_params)

    respond_to do |format|
      if @applicant.save

UPDATE "applicants" SET "last_name" = ?, "email" = ?, "phone" = ?, "zipcode" = ?, "updated_at" = ? WHERE "applicants"."id" = ?  [["last_name", "Jain"], ["email", "swatijain.purdue@gmail.com"], ["phone", "4085504947"], ["zipcode", "94560"], ["updated_at", "2018-02-05 00:18:00.316480"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @applicant.update(applicant_params)

DELETE FROM "applicants" WHERE "applicants"."id" = ?  [["id", 1]]
---
  def destroy
    @applicant.destroy

SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])